---
kind: other
id: Methods.T:Autodesk.Revit.UI.IDockablePaneProvider
source: html/3f4d9ebb-774f-1ba1-ec84-36f6d9f163dc.htm
---
# IDockablePaneProvider Methods

Method called during initialization of the user interface to gather information about a dockable pane window.